

/*
3. Написать программу выполняющую сериализацию и десериализацию. Создать класс Point со свойствами float X, float Y. 
Создать класс Shape со свойствами Point ShapePoint, float Length, float Height, string Name. 
В методе Main создать массив из заполненных элементов типа Shape. Выполнить сериализацию и десериализацию этого массива. 
Название файла для сериализации и десериализации вводить с клавиатуры. Сериализуемые форматы XML и JSON. 
Так же необходимо использовать блоки для обработки исключений.
После выполнения задания, скачать nuget-пакет Newtonsoft.Json. 
Попробовать выполнить сериализацию с помощью Json сериализатора из этого пакета
*/
